#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hamacorp/learn-terraform-staging/runs/run-gdzTeGoKLbeXxuQ6

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.network.aws_vpc.main: Refreshing state... [id=vpc-0c0b8b8c29e4ef316]
module.network.aws_network_acl.network_acl_vpc: Refreshing state... [id=acl-035bfbc0ffa0cd0ce]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0eece839f7a0ce6e3]
module.network.aws_subnet.private_db_subnet[0]: Refreshing state... [id=subnet-06c4e35724155f6f0]
module.network.aws_subnet.private_db_subnet[1]: Refreshing state... [id=subnet-0ef70c9028ba30880]
module.network.aws_subnet.private_app_subnet[2]: Refreshing state... [id=subnet-0f98966236af5e20d]
module.network.aws_subnet.private_network_subnet[0]: Refreshing state... [id=subnet-06aeed3a60238f917]
module.network.aws_subnet.private_db_subnet[2]: Refreshing state... [id=subnet-0b4c9ac7d17e5682f]
module.network.aws_subnet.private_network_subnet[2]: Refreshing state... [id=subnet-0babdb81143f6dbe7]
module.network.aws_subnet.private_app_subnet[0]: Refreshing state... [id=subnet-0e90474544f5cceec]
module.network.aws_subnet.private_network_subnet[1]: Refreshing state... [id=subnet-082eff63ef819af46]
module.network.aws_subnet.private_app_subnet[1]: Refreshing state... [id=subnet-023a3c9bdfcd4b0e4]
module.network.aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-003e4d69a756a9a65]
module.network.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-088dd6150e922d5cd]
module.network.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0354ca8e560827c7d]
module.network.aws_network_acl.network_acl_private_db_subnet[2]: Refreshing state... [id=acl-0c59670ea14f01bef]
module.network.aws_network_acl.network_acl_private_db_subnet[1]: Refreshing state... [id=acl-0a591bf2a33f9f186]
module.network.aws_network_acl.network_acl_private_db_subnet[0]: Refreshing state... [id=acl-0e98382d76b2e395c]
module.network.aws_network_acl.network_acl_private_network_subnet[0]: Refreshing state... [id=acl-0f9b10944147523a2]
module.network.aws_network_acl.network_acl_private_network_subnet[1]: Refreshing state... [id=acl-0218c8e03d0c45a20]
module.network.aws_network_acl.network_acl_private_network_subnet[2]: Refreshing state... [id=acl-061ad089245e577a3]
module.network.aws_network_acl.network_acl_private_app_subnet[2]: Refreshing state... [id=acl-0a82ae8e87ee83287]
module.network.aws_network_acl.network_acl_private_app_subnet[0]: Refreshing state... [id=acl-0599a360b99fa5677]
module.network.aws_network_acl.network_acl_private_app_subnet[1]: Refreshing state... [id=acl-01de424eb6d865fae]
module.network.aws_network_acl.network_acl_public_subnet[1]: Refreshing state... [id=acl-0042a62965387126e]
module.network.aws_network_acl.network_acl_public_subnet[0]: Refreshing state... [id=acl-083ab00d766913ea0]
module.network.aws_network_acl.network_acl_public_subnet[2]: Refreshing state... [id=acl-0bdf86ae31ccd45d3]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.network.aws_network_acl.network_acl_vpc has changed
  ~ resource "aws_network_acl" "network_acl_vpc" {
        id         = "acl-035bfbc0ffa0cd0ce"
      + tags       = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nat_instance.aws_autoscaling_group.nat_instance[0] will be created
  + resource "aws_autoscaling_group" "nat_instance" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "ap-southeast-1a",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "NAT_Instance"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }
    }

  # module.nat_instance.aws_autoscaling_group.nat_instance[1] will be created
  + resource "aws_autoscaling_group" "nat_instance" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "ap-southeast-1b",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "NAT_Instance"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }
    }

  # module.nat_instance.aws_autoscaling_group.nat_instance[2] will be created
  + resource "aws_autoscaling_group" "nat_instance" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "ap-southeast-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "NAT_Instance"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }
    }

  # module.nat_instance.aws_eip.public_ip_nat[0] will be created
  + resource "aws_eip" "public_ip_nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc                  = true
    }

  # module.nat_instance.aws_eip.public_ip_nat[1] will be created
  + resource "aws_eip" "public_ip_nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc                  = true
    }

  # module.nat_instance.aws_eip.public_ip_nat[2] will be created
  + resource "aws_eip" "public_ip_nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc                  = true
    }

  # module.nat_instance.aws_launch_template.nat_instance[0] will be created
  + resource "aws_launch_template" "nat_instance" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c3e153a33c34af18"
      + instance_type   = "t3.small"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "NAT_Instance"
      + tags            = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all        = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + device_index         = 0
          + network_interface_id = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Module" = "NAT Instance"
              + "Name"   = "NAT_Instance"
            }
        }
    }

  # module.nat_instance.aws_launch_template.nat_instance[1] will be created
  + resource "aws_launch_template" "nat_instance" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c3e153a33c34af18"
      + instance_type   = "t3.small"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "NAT_Instance"
      + tags            = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all        = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + device_index         = 0
          + network_interface_id = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Module" = "NAT Instance"
              + "Name"   = "NAT_Instance"
            }
        }
    }

  # module.nat_instance.aws_launch_template.nat_instance[2] will be created
  + resource "aws_launch_template" "nat_instance" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c3e153a33c34af18"
      + instance_type   = "t3.small"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "NAT_Instance"
      + tags            = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all        = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + device_index         = 0
          + network_interface_id = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Module" = "NAT Instance"
              + "Name"   = "NAT_Instance"
            }
        }
    }

  # module.nat_instance.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-088dd6150e922d5cd"
      + tags                      = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all                  = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.nat_instance.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-0354ca8e560827c7d"
      + tags                      = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all                  = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.nat_instance.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-003e4d69a756a9a65"
      + tags                      = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all                  = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.nat_instance.aws_route.internet[0] will be created
  + resource "aws_route" "internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.nat_instance.aws_route.internet[1] will be created
  + resource "aws_route" "internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.nat_instance.aws_route.internet[2] will be created
  + resource "aws_route" "internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.nat_instance.aws_route_table.nat[0] will be created
  + resource "aws_route_table" "nat" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all         = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id           = "vpc-0c0b8b8c29e4ef316"
    }

  # module.nat_instance.aws_route_table.nat[1] will be created
  + resource "aws_route_table" "nat" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all         = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id           = "vpc-0c0b8b8c29e4ef316"
    }

  # module.nat_instance.aws_route_table.nat[2] will be created
  + resource "aws_route_table" "nat" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all         = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id           = "vpc-0c0b8b8c29e4ef316"
    }

  # module.nat_instance.aws_security_group.nat[0] will be created
  + resource "aws_security_group" "nat" {
      + arn                    = (known after apply)
      + description            = "Rules for Nat instance - ap-southeast-1a"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.1.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "NatAzA"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all               = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id                 = "vpc-0c0b8b8c29e4ef316"
    }

  # module.nat_instance.aws_security_group.nat[1] will be created
  + resource "aws_security_group" "nat" {
      + arn                    = (known after apply)
      + description            = "Rules for Nat instance - ap-southeast-1b"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "NatAzB"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all               = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id                 = "vpc-0c0b8b8c29e4ef316"
    }

  # module.nat_instance.aws_security_group.nat[2] will be created
  + resource "aws_security_group" "nat" {
      + arn                    = (known after apply)
      + description            = "Rules for Nat instance - ap-southeast-1c"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.3.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "NatAzC"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + tags_all               = {
          + "Module" = "NAT Instance"
          + "Name"   = "NAT_Instance"
        }
      + vpc_id                 = "vpc-0c0b8b8c29e4ef316"
    }

Plan: 21 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @avosalmon, Action: `pull_request`*